/*******************************************************************************
* タイトル:		デバッグ表示処理
* プログラム名:	debugproc.cpp
* 作成者:		TH教務部　寄光
* 作成日:		2015/10/20
********************************************************************************
* 更新履歴:		- 2015/10/20	 寄光
*					- V1.00		Initial Version
*******************************************************************************/
#ifndef _DEBUGPROC_H_
#define _DEBUGPROC_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitDebugProc(void);
void UninitDebugProc(void);
void UpdateDebugProc(void);
void DrawDebugProc(void);

void PrintDebugProc(char *fmt,...);

#endif