/*******************************************************************************
* タイトル:		Xファイル処理
* プログラム名:	XFile.h
* 作成者:		GP11A331 4番 伊原佑稀
* 作成日:		2016/01/18
********************************************************************************
* 更新履歴:		- 2016/01/18	伊原佑稀
*					- V1.00		Initial Version
*******************************************************************************/
#ifndef _XFILE_H_
#define _XFILE_H_

#include "Main.h"

//**************************************
// Xファイル構造体
//**************************************
typedef struct
{
	LPD3DXMESH			pD3DXMesh;			// メッシュ情報へのポインタ
	LPD3DXBUFFER		pD3DXBuffMate;		// マテリアル情報へのポインタ
	DWORD				nNumMate;			// マテリアル情報の数
	LPDIRECT3DTEXTURE9	pD3DTexture;		// テクスチャへのポインタ
} XFILE;

//*****************************************************************************
// Xファイル列挙体
//*****************************************************************************
typedef enum
{
	XFILE_TEST_FILE = 0,
	MAX_JELLYFISH_XFILE
} JELLYFISH_XFILE_NAME;


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitXFile(void);
void UninitXFile(void);
XFILE *GetpJellyfishXFile(void);

#endif
